In [1]:
import numpy as np
import pandas as pd

In [2]:
#series

In [3]:
labels = ['a','b','c']
minha_lista = [10,20,30]

In [4]:
arr = np.array([10,20,30])
d = {'a':10,'b':20,'c':30}

In [6]:
pd.Series(['ueda','anderson','miura','sandro'])

0        ueda
1    anderson
2       miura
3      sandro
dtype: object

In [ ]:
pd.Series()

In [7]:
pd.Series(data=minha_lista,index=labels)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(data=arr,index=labels)

a    10
b    20
c    30
dtype: int32

In [9]:
ser1 = pd.Series([1,2,3,4],index=['EUA','Alemanha','Russia','Japão'])

In [10]:
ser1

EUA         1
Alemanha    2
Russia      3
Japão       4
dtype: int64

In [16]:
ser2 = pd.Series([1,2,3,4],index=['Brasil','Alemanha','EUA','Japão'])

In [17]:
ser2

Brasil      1
Alemanha    2
EUA         3
Japão       4
dtype: int64

In [18]:
ser1 + ser2

Alemanha    4.0
Brasil      NaN
EUA         4.0
Japão       8.0
Russia      NaN
dtype: float64

In [ ]:
#no python o nulo é None
#no pandas do python o nulo é NaN

In [ ]:
#dataframe
#é um conjunto de series

In [26]:
#para gerar numeros aleatórios controlados
np.random.seed(101)

In [27]:
df = pd.DataFrame(data=np.random.randn(5,4),index='A B C D E'.split(),columns='W X Y Z'.split())

In [31]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#select w from df

In [33]:
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [35]:
df['Y']

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [36]:
df.W

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [37]:
type(df)

pandas.core.frame.DataFrame

In [38]:
type(df['W'])

pandas.core.series.Series

In [ ]:
#select X, Y, Z from df

In [39]:
df[['X','Y','Z']]

          X         Y         Z
A  0.628133  0.907969  0.503826
B -0.319318 -0.848077  0.605965
C  0.740122  0.528813 -0.589001
D -0.758872 -0.933237  0.955057
E  1.978757  2.605967  0.683509

In [41]:
colunas = ['Y','X','W']

In [42]:
df[colunas]

          Y         X         W
A  0.907969  0.628133  2.706850
B -0.848077 -0.319318  0.651118
C  0.528813  0.740122 -2.018168
D -0.933237 -0.758872  0.188695
E  2.605967  1.978757  0.190794

In [ ]:
#modo semelhante ao sql

In [43]:
df.X

A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [44]:
df.Y

A    0.907969
B   -0.848077
C    0.528813
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [45]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df['W'] + df['X']

A    3.334983
B    0.331800
C   -1.278046
D   -0.570177
E    2.169552
dtype: float64

In [48]:
df['nova_coluna']  = df['W'] + df['Z']

In [49]:
df

          W         X         Y         Z  nova_coluna
A  2.706850  0.628133  0.907969  0.503826     3.210676
B  0.651118 -0.319318 -0.848077  0.605965     1.257083
C -2.018168  0.740122  0.528813 -0.589001    -2.607169
D  0.188695 -0.758872 -0.933237  0.955057     1.143752
E  0.190794  1.978757  2.605967  0.683509     0.874303

In [50]:
df['nova_coluna'] = 0

In [51]:
df

          W         X         Y         Z  nova_coluna
A  2.706850  0.628133  0.907969  0.503826            0
B  0.651118 -0.319318 -0.848077  0.605965            0
C -2.018168  0.740122  0.528813 -0.589001            0
D  0.188695 -0.758872 -0.933237  0.955057            0
E  0.190794  1.978757  2.605967  0.683509            0

In [53]:
df['XXX'] = '20200904'

In [54]:
df

          W         X         Y         Z  nova_coluna       XXX
A  2.706850  0.628133  0.907969  0.503826            0  20200904
B  0.651118 -0.319318 -0.848077  0.605965            0  20200904
C -2.018168  0.740122  0.528813 -0.589001            0  20200904
D  0.188695 -0.758872 -0.933237  0.955057            0  20200904
E  0.190794  1.978757  2.605967  0.683509            0  20200904

In [56]:
df = df.drop('XXX',axis=1)

In [57]:
df

          W         X         Y         Z  nova_coluna
A  2.706850  0.628133  0.907969  0.503826            0
B  0.651118 -0.319318 -0.848077  0.605965            0
C -2.018168  0.740122  0.528813 -0.589001            0
D  0.188695 -0.758872 -0.933237  0.955057            0
E  0.190794  1.978757  2.605967  0.683509            0

In [ ]:
df = df.drop('NEW',axis=1)

In [58]:
df = df.drop('A', axis=0)

In [59]:
df

          W         X         Y         Z  nova_coluna
B  0.651118 -0.319318 -0.848077  0.605965            0
C -2.018168  0.740122  0.528813 -0.589001            0
D  0.188695 -0.758872 -0.933237  0.955057            0
E  0.190794  1.978757  2.605967  0.683509            0

In [ ]:
#dataframe são imutáveis, ou você usa o inplace ou você joga tudo em  uma variável

In [60]:
df.drop('nova_coluna',axis=1, inplace=True)

In [61]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#acessar os elementos específicos de um dataframe

In [63]:
df.loc['B']

W    0.651118
X   -0.319318
Y   -0.848077
Z    0.605965
Name: B, dtype: float64

In [64]:
df.loc['B','W']

0.6511179479432686

In [66]:
df.loc[['B','C'],['X']]

          X
B -0.319318
C  0.740122

In [68]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [74]:
df.iloc[0][0]

0.6511179479432686

In [79]:
df.iloc[:2][1:]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [80]:
df.W[0]

0.6511179479432686

In [ ]:
#usando algo semelhante ao WHERE do SQL

In [81]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [82]:
df > 1

       W      X      Y      Z
B  False  False  False  False
C  False  False  False  False
D  False  False  False  False
E  False   True   True  False

In [83]:
df + 10

           W          X          Y          Z
B  10.651118   9.680682   9.151923  10.605965
C   7.981832  10.740122  10.528813   9.410999
D  10.188695   9.241128   9.066763  10.955057
E  10.190794  11.978757  12.605967  10.683509

In [84]:
df * 2

          W         X         Y         Z
B  1.302236 -0.638636 -1.696154  1.211931
C -4.036336  1.480244  1.057627 -1.178001
D  0.377391 -1.517744 -1.866474  1.910113
E  0.381589  3.957515  5.211935  1.367018

In [85]:
df / 3

          W         X         Y         Z
B  0.217039 -0.106439 -0.282692  0.201988
C -0.672723  0.246707  0.176271 -0.196334
D  0.062898 -0.252957 -0.311079  0.318352
E  0.063598  0.659586  0.868656  0.227836

In [87]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [86]:
df + df

          W         X         Y         Z
B  1.302236 -0.638636 -1.696154  1.211931
C -4.036336  1.480244  1.057627 -1.178001
D  0.377391 -1.517744 -1.866474  1.910113
E  0.381589  3.957515  5.211935  1.367018

In [88]:
bol = df > 0

In [89]:
bol

       W      X      Y      Z
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [90]:
df[bol]

          W         X         Y         Z
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [92]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [93]:
df[df['W'] > 0]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [94]:
df[df['W'] > 0]['Y']

B   -0.848077
D   -0.933237
E    2.605967
Name: Y, dtype: float64

In [95]:
df[(df['W'] > 0) & (df['Y'] > 1) ]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [96]:
df[(df['W'] > 0) | (df['Y'] > 1) ]

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [97]:
df.reset_index()

  index         W         X         Y         Z
0     B  0.651118 -0.319318 -0.848077  0.605965
1     C -2.018168  0.740122  0.528813 -0.589001
2     D  0.188695 -0.758872 -0.933237  0.955057
3     E  0.190794  1.978757  2.605967  0.683509

In [ ]:
#

In [103]:
col = 'RS SP MG AM'.split()

In [104]:
col

['RS', 'SP', 'MG', 'AM']

In [105]:
df

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [106]:
df['Estados'] = col

In [107]:
df

          W         X         Y         Z Estados
B  0.651118 -0.319318 -0.848077  0.605965      RS
C -2.018168  0.740122  0.528813 -0.589001      SP
D  0.188695 -0.758872 -0.933237  0.955057      MG
E  0.190794  1.978757  2.605967  0.683509      AM

In [108]:
df.set_index('Estados')

                W         X         Y         Z
Estados
RS       0.651118 -0.319318 -0.848077  0.605965
SP      -2.018168  0.740122  0.528813 -0.589001
MG       0.188695 -0.758872 -0.933237  0.955057
AM       0.190794  1.978757  2.605967  0.683509